[   
    {
      "id": 1,
      "picture": "https://media.istockphoto.com/vectors/vector-of-a-big-businessman-hand-pulling-a-closet-compartment-box-a-vector-id1220450857?k=20&m=1220450857&s=612x612&w=0&h=hXZOnA8DbzUtHPtTg_rhAozUqG4O7clDceoouqNFhhM=",
      "title": "Introduction to Databse",
      "description": "A database, in the most general sense, is an organized collection of data. More specifically, a database is an electronic system that allows data to be easily accessed, manipulated and updated. In other words, a database is used by an organization as an electronic way to store, manage and retrieve information.",
      "modules" : [
        {
            "m1": "Data Abstraction",
            "m2": "Basic SQL statements",
            "m3": "Entity Relationship Modeling",
            "m4": "Logical Database Design",
            "m5": "Structured Query Language"
        }
      ],
      "price": 80
  
    },
    {
      "id": 2,
      "picture": "https://miro.medium.com/max/1024/1*McLYEFaMXdYiZ0Y5O3VaBQ.png",
      "title": "Compiler Design",
      "description": "The course will help to understand and solve all the questions related to GATE exam. Compilers provide you with the theoretical and practical knowledge that is needed to implement a programming language. Once you learn to do compiler, you pretty much know the innards of many programming languages. Moreover, judging a programming language by its essential features will become easy for you.",
      "modules" : [
        {
            "m1": "Phases of Compiler",
            "m2": "Symbol Table",
            "m3": "Lexical Analysis",
            "m4": "Syntax Analysis",
            "m5": "Intermediate Code Generation"
        }
      ],
      "price": 150
  
    },
    {
      "id": 3,
      "picture": "https://ischoolonline.berkeley.edu/wp-content/uploads/sites/37/2021/01/4430_whatismachinelearning_hero.jpg",
      "title": "Algorithms",
      "description": "Throughout this Data Structures and Algorithms with C course, a step by step approach is followed to make you understand different Data Structures and Algorithms. You will see code implementation of different data structures in C language and algorithms are explained in step-wise manner. Through this course you can build a strong foundation and it will help you to crack Data Structures and Algorithms in C coding interviews questions and work on projects. Good foundation on Data Structures and Algorithms in C interview topics helps you to attempt tricky interview questions.",
      "modules" : [
        {
            "m1": "Algorithm Analysis",
            "m2": "Linked List",
            "m3": "Stack and Queue",
            "m4": "Sorting",
            "m5": "Heap"
        }
      ],
      "price": 120
  
    },
    {
      "id": 4,
      "picture": "https://thumbs.dreamstime.com/b/isometric-programmer-coding-new-project-web-development-programming-skills-website-banner-illustration-team-engineers-130721664.jpg",
      "title": "Programming Language",
      "description": "The goal of this course is to teach the key programming and problem-solving skills where the students will be able to design, implement, debug, and test structured and Object-Oriented Programs (OOP).Fundamentals of Structured and OOP programming including Data types, Operators & Expressions; Standard input/output (I/O); Conditional statements (if…else), Switch; Loops (do...while, while, for); Arrays (single, multidimensional); Pointers, Functions; Structure, Unions & Enumerations; Strings using C++",
      "modules" : [
        {
            "m1": "Data Abstraction",
            "m2": "Basic SQL statements",
            "m3": "Entity Relationship Modeling",
            "m4": "Logical Database Design",
            "m5": "Structured Query Language"
        }
      ],
      "price": 220
  
    },
    {
      "id": 5,
      "picture": "https://img.freepik.com/free-vector/web-development-programmer-engineering-coding-website-augmented-reality-interface-screens-developer-project-engineer-programming-software-application-design-cartoon-illustration_107791-3863.jpg",
      "title": "Web Technologies",
      "description": "We start off by introducing the underlying technologies of the web: URI, HTTP, HTML, CSS and XML. If this sounds cryptic, rest assured that you will soon become familiar with what it’s all about. We will then focus on web services and web programming technologies along with their practical application. And we will look at how search engines – our fast and reliable signposts in the digital world – actually work to find contents and services on the web. The course concludes with a look at cloud computing and how it is changing the way we will access computing power in the future.",
      "modules" : [
        {
            "m1": "Data Abstraction",
            "m2": "Basic SQL statements",
            "m3": "Entity Relationship Modeling",
            "m4": "Logical Database Design",
            "m5": "Structured Query Language"
        }
      ],
      "price": 100
  
    },
    {
      "id": 6,
      "picture": "https://techiediva.com/wp-content/uploads/2018/08/developer-3461405_960_720.png",
      "title": "Software Engineering",
      "description": "Despite the wealth of development knowledge, experience, and tools available today, a substantial percentage of software projects fail, often because requirements are not correctly determined and defined at the outset or are not managed correctly as the project unfolds. This course focuses on this critical cause of failure and offers a practical, proven approach to building systems that meet customers' needs on time and within budget.In this course the students will learn how analysts and developers can effectively identify requirements by applying a variety of techniques, centered on the power of use cases.",
      "modules" : [
        {
            "m1": "Data Abstraction",
            "m2": "Basic SQL statements",
            "m3": "Entity Relationship Modeling",
            "m4": "Logical Database Design",
            "m5": "Structured Query Language"
        }
      ],
      "price": 160
  
    },
    {
      "id": 7,
      "picture": "https://img.freepik.com/premium-photo/minimal-cartoon-mathematic-learning-education-concept-calculator-basic-math-operation-symbols-math-plus-minus-multiplication-number-divide-cream-pastel-background-3d-render-illustration_598821-1160.jpg?w=2000",
      "title": "Discrete Mathematics",
      "description": "Discrete mathematics forms the mathematical foundation of computer and information science. It is also a fascinating subject in itself.Learners will become familiar with a broad range of mathematical objects like sets, functions, relations, graphs, that are omnipresent in computer science. Perhaps more importantly, they will reach a certain level of mathematical maturity - being able to  understand formal statements and their proofs; coming up with rigorous proofs themselves; and coming up with interesting results.This course attempts to be rigorous without being overly formal. This means, for every concept we introduce we will show at least one interesting and non-trivial result and give a full proof. However, we will do so without too much formal notation, employing examples and figures whenever possible.",
      "modules" : [
        {
            "m1": "Data Abstraction",
            "m2": "Basic SQL statements",
            "m3": "Entity Relationship Modeling",
            "m4": "Logical Database Design",
            "m5": "Structured Query Language"
        }
      ],
      "price": 50
  
    },
    {
      "id": 8,
      "picture": "https://reconshell.com/wp-content/uploads/2021/02/SQLpt.jpg",
      "title": "Data Structure",
      "description": "Define data structure for computer programming; Explain ADTs along with their advantages and disadvantages; Details of array, stack, queue, linked list and trees and their applications. Explain different types of algorithms to search and sort and manipulate data using such data structure; Sorting Algorithm: Selection Sort, Bubble Sort, Counting Sort; Searching Algorithm: Linear and Binary Search; Demonstrate algorithms for efficient searching, insertion and deletion operation for every data structure by computer programs; Explain Tree; Basic terminology (Node, Vertex, Leaf, Left subtree, Right subtree, Height, Depth, m-ary tree), Binary tree, Binary tree representation, Binary tree traversal, Simulations.; Binary search tree",
      "modules" : [
        {
            "m1": "Data Abstraction",
            "m2": "Basic SQL statements",
            "m3": "Entity Relationship Modeling",
            "m4": "Logical Database Design",
            "m5": "Structured Query Language"
        }
      ],
      "price": 180
  
    },
    {
      "id": 9,
      "picture": "https://i.pinimg.com/736x/76/00/6c/76006cd1dd6a863412a7ef2121761799.jpg",
      "title": "Computer Fundamentals",
      "description": "Using a Computer to Its Full Potential: A Comprehensive Introduction to Computers The following are some of the skills you'll need: - Desktop support; IT support; computer fundamentals; and basic computer skills.Understand each and every topic of computer science and become an expert in its application. Because we all have computers or are computer students, I am concentrating my efforts in this course on assisting you in understanding every vital concept you will encounter for the first time because Computer Basic is the most important concept you will encounter. In this introductory computer course, students learn the fundamentals of computers. We will go into further detail on input, output, the CPU, memory, and storage devices. These notions can assist you in feeling more comfortable while using a computer. Here's how it works: Furthermore, these themes will improve your imagination and help you become more self-sufficient in your search for the proper item.",
      "modules" : [
        {
            "m1": "Data Abstraction",
            "m2": "Basic SQL statements",
            "m3": "Entity Relationship Modeling",
            "m4": "Logical Database Design",
            "m5": "Structured Query Language"
        }
      ],
      "price": 50
  
    }
  ]